app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    session[:session_id] # this forces load of the session in Rails 2.3.x
    @sid = request.session_options[:id]
    @products = Product.all

INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`, `product_code`) VALUES('test product', 9, '2011-12-06 14:37:09', '2011-12-06 14:37:09', 113)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save