app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM `products` ORDER BY product_code

  def add_to_cart
    product = Product.find(params[:product_id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)